Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: Using the prefix(through:) method is equivalent to using a partial closed range as the collection’s subscript.
ja: prefix(through:)メソッドを使うことは、部分的な完結範囲をコレクションのもつ添え字として使うことと同等です。

source: Using the prefix(upTo:) method is equivalent to using a partial half-open range as the collection’s subscript.
ja: prefix(upTo:)メソッドを使うことは、部分的な半開範囲をコレクションのもつ添え字として使うことと同等です。

source: Using the return statement in the body closure will exit only from the current call to body, not from any outer scope, and won’t skip subsequent calls.
ja: return文をbodyクロージャにおいて使うことは、ただ現在のbodyへの呼び出しから抜け出すだけです、全く外側のスコープからではなくて、そして続いて起こる呼び出しを飛ばしません。

source: Using the suffix(from:) method is equivalent to using a partial range from the index as the collection’s subscript.
ja: suffix(from:)メソッドを使うことは、インデックスからの部分的範囲をコレクションのもつ添え字として使うことと同等です。

source: Using the closed range operator (...) to form ClosedRange instances is preferred.
ja: 完結範囲演算子（...）を使ってClosedRangeインスタンスを形成することが推奨されます。

source: Using this method with types that have a noninteger Stride may result in an approximation.
ja: このメソッドを非整数Strideを持つ型とともに使うことは、近似値という結果になるかもしれません。

source: Valid indices consist of the position of every element and a “past the end” position that’s not valid for use as a subscript argument.
ja: 有効なインデックスは、各要素の位置、および添え字引数として使うのに有効でない“終わりを過ぎた”位置から成ります。

source: Valid indices consist of the position of every element and a “past the end” position that’s not valid for use as a subscript.
ja: 有効なインデックスは、各要素の位置、および添え字として使うのに有効でない“終わりを過ぎた”位置から成ります。

source: Valid types for ExtendedGraphemeClusterLiteralType are Character, String, and StaticString.
ja: ExtendedGraphemeClusterLiteralTypeに対して有効な型は、Character、String、そしてStaticStringです。

source: Valid types for FloatLiteralType are Float, Double, and Float80 where available.
ja: FloatLiteralTypeに対して有効な型は、Float、Double、そして利用可能なところではFloat80です。

source: Valid types for StringLiteralType are String and StaticString.
ja: StringLiteralTypeに対する有効な型は、StringとStaticStringです。

source: Valid types for UnicodeScalarLiteralType are Unicode.Scalar, Character, String, and StaticString.
ja: UnicodeScalarLiteralTypeに対する有効な型は、Unicode.Scalar、Character、String、そしてStaticStringです。

source: Value
ja: 値

source: Value Literals
ja: 値リテラル

source: Value conversion from one integer type to another.
ja: ある整数型から別のものへの値変換。

source: Values can be yielded in case to the continuation passed into the build closure.
ja: 値それらは、ビルドクロージャに渡される継続に備えて生み出されることが可能です。

source: Visible side effects are therefore strongly discouraged within this property.
ja: 目に見える副作用は、それゆえにこのプロパティ内では強く反対されます。

source: Warning
ja: 警告

source: When error is an empty string, lhs evaluates to true and rhs is not evaluated, skipping the call to majorErrors.contains(_:).
ja: errorが空の文字列である時、lhsがtrueに評価して、rhsは評価されず、majorErrors.contains(_:)への呼び出しを省きます。

source: When error is not an empty string, lhs evaluates to false and rhs is evaluated.
ja: errorが空の文字列ではない時、lhsがfalseに評価して、rhsは評価されます。

source: When letterCounts[letter, default: 0] += 1 is executed with a value of letter that isn’t already a key in letterCounts, the specified default value (0) is returned from the subscript, incremented, and then added to the dictionary under that key.
ja: letterCounts[letter, default: 0] += 1がletterの値でまだletterCountsの中のキーでないものと実行される場合、指定された値（0）が添え字から返されて、漸増されて、それから辞書へとそのキーのもと追加されます。

source: When letters.reduce(into:_:) is called, the following steps occur:
ja: letters.reduce(into:_:)が呼び出される時、以下の段階が生じます：

source: When measurements.count is equal to zero, lhs evaluates to false and rhs is not evaluated, preventing a divide-by-zero error in the expression sum / Double(measurements.count).
ja: measurements.countがゼロに等しい時、lhsがfalseに評価して、rhsは評価されず、式sum / Double(measurements.count)でのゼロによる除算を防ぎます。

source: When measurements.count is greater than zero, lhs evaluates to true and rhs is evaluated.
ja: measurements.countがゼロより大きい時、lhsがtrueに評価して、rhsは評価されます。

source: When numbers.reduce(_:_:) is called, the following steps occur:
ja: numbers.reduce(_:_:)が呼び出される時、以下の段階が生じます：

source: When nil is passed, the label is omitted.
ja: nilが渡される場合、ラベルは省かれます。

source: When count is passed to the printInfo(_:) function, however, the value parameter has a static type of Any (the type declared for the parameter) and a dynamic type of Int.
ja: countがprintInfo(_:)関数に渡される場合は、しかしながら、valueパラメータはAnyの静的型（このパラメータに対して宣言された型）そしてIntの動的型を持ちます。

source: When id values are imported into Swift as Any, the runtime automatically handles bridging back to either class references or value types.
ja: id値がスウィフトへAnyとしてインポートされる時、ランタイムはクラス参照または値型のどちらかへの逆のブリッジを自動的に取り扱います。

source: When notSoGoodNumber is initialized, Int("invalid-input") fails and returns nil, and so Int("42") is called to supply a default value.
ja: notSoGoodNumberが初期化されるとき、Int("invalid-input")は失敗してnilを返します、そうするとInt("42")が呼び出されて省略時の値を提供します。

source: When notSoGoodNumber is initialized, Int("invalid-input") fails and returns nil, and so the getDefault() method is called to supply a default value.
ja: notSoGoodNumberが初期化されるとき、Int("invalid-input")は失敗してnilを返します、そうするとgetDefault()メソッドが呼び出されて省略時の値を提供します。

source: When printGenericInfo(_:) is called with a string that has P as its static type, the call to type(of:) returns P.self instead of String.self (the dynamic type inside the parameter).
ja: printGenericInfo(_:)が、Pをそれの静的型として持つ文字列とともに呼ばれる時、type(of:)への呼び出しはP.selfを返します、String.self（パラメータの内部の動的型）ではなく。

source: When Swift code imports Objective-C APIs, the importer replaces Foundation reference types with their corresponding value types.
ja: SwiftコードがObjective-C APIをインポートする場合、インポータはFoundation参照型をそれらの対応する値型で置き換えます。

source: When Swift imports APIs that have not been annotated, the compiler cannot automatically memory-manage the returned Core Foundation objects.
ja: 注釈をつけられなかったAPIをSwiftがインポートする場合、コンパイラは返されたCore Foundationオブジェクトを自動的にメモリ管理できません。

source: When Swift imports Core Foundation types, the compiler remaps the names of these types.
ja: スウィフトがCore Foundation型をインポートするとき、コンパイラはこれらの型の名前をリマップします。

source: When a closed range uses integers as its lower and upper bounds, or any other type that conforms to the Strideable protocol with an integer stride, you can use that range in a for-in loop or with any sequence or collection method.
ja: ある完結範囲がそれの下側および上側の境界として整数を使う、または整数歩幅を使うStrideableプロトコルに準拠する何らかの他の型を使う場合、あなたはその範囲をfor-inループにおいて、または何らかのシーケンスまたはコレクションのメソッドで使用できます。

source: When a dictionary outgrows its buffer, existing indices may be invalidated without any notification.
ja: 辞書がそれのバッファより大きくなる時、既存のインデックスは何の通知もなしに無効にされるでしょう。

source: When a dictionary’s Value type has value semantics, you can use this subscript to perform in-place operations on values in the dictionary.
ja: ある辞書の持つValue型が値意味論を持つ場合、あなたはこの添え字を使うことで、辞書の中の値の上でその場での演算を実行できます。

source: When a value is successfully enqueued, either buffered or immediately consumed to resume a pending call to next and a count of remaining slots available in the buffer at the point in time of yielding.
ja: ある値が成功裏に待ち行列に入れられる時、nextへの未解決の呼び出しを再開するためにバッファしたか直ちに消費したかどちらか、そして生み出す時点でバッファにおいて利用可能な残りの投入口の総数。

source: When accessing a computed property corresponding to a bit field, Swift automatically converts the value to and from compatible Swift types.
ja: あるビットフィールドに対応している計算プロパティにアクセスするとき、スウィフトはその値を自動的に互換性のあるスウィフト型へと、またはそれから、変換します。

source: When an array has additional capacity and is not sharing its storage with another instance, appending an element is O(1).
ja: 配列がさらなる容量を持っていてそれのストレージを別のインスタンスと共有していない場合、ある要素を追加することはO(1)です。

source: When an array needs to reallocate storage before appending or its storage is shared with another copy, appending is O(n), where n is the length of the array.
ja: 配列が追加の前にストレージの際割り当てを必要とするかそれのストレージを別のコピーと共有する場合、追加作業はO(n)です、そこでnは配列の長さです。

source: When an event occurs—such as a user resizing a window—a class that's a delegator will detect the event and call delegate methods on the class you specify as the delegate.
ja: イベントが発生する場合 — 例えばユーザがウインドウをリサイズするなど — 委任元であるクラスはイベントを検出します、そしてあなたが委任先として指定するクラス上で委任先メソッドを呼び出します。

source: When building an app target, you can provide a custom name for the product module by changing the Product Module Name build setting.
ja: アプリターゲットをビルドする場合、あなたはあつらえの名前を製品モジュールに提供することがProduct Module Name build設定を変更することによって可能です。

source: When calling the new Int initializer within a do statement, you can use pattern matching to match specific cases of your custom error type and access their associated values, as in the example below.
ja: この新しいIntイニシャライザをdo文内部で呼び出すとき、あなたはパターンマッチを使ってあなたのあつらえのエラー型のそれぞれ詳述なケース節と照合して、それらの関連値にアクセスします、下の例でのように。

source: When comparing two values with this method, -0 is equal to +0.
ja: ２つの値をこのメソッドで比較する場合、-0は+0と等しいです。

source: When converting floating-point values, the init?(exactly:) initializer checks both that the passed value has no fractional part and that the value is representable in the resulting type.
ja: 浮動小数点値を変換するとき、init?(exactly:)イニシャライザは、渡された値が小数部を持たないこと、そしてその値が結果となる型の中に表現可能であることの両方を検査します。

source: When creating a custom collection type, add the minimal requirements of the Collection protocol: starting and ending indices and a subscript for accessing elements.
ja: あつらえのコレクション型を作成する場合、Collectionプロトコルの最小限の要件：始まりと終わりのインデックスおよび要素にアクセスするための添え字、を加えてください。

source: When declarations in an Objective-C header file refer to a Swift class or protocol that comes from the same target, importing the generated header creates a cyclical reference.
ja: Objective-Cヘッダファイルの中の宣言がその同じターゲットからやってくるSwiftクラスまたはプロトコルを参照する場合、生成ヘッダのインポートは循環参照を生み出します。

source: When implementing an ExpressibleByStringInterpolation conformance, set the StringInterpolation associated type to DefaultStringInterpolation to get the same interpolation behavior as Swift’s built-in String type and construct a String with the results.
ja: ExpressibleByStringInterpolation準拠を実装する場合は、StringInterpolation関連型をDefaultStringInterpolationに設定することで、Swiftの組込みString型と同じ補間挙動を取得してください、そしてあるStringをその結果で組み立ててください。

source: When implementing the == method and the hash(into:) method, use all the properties that affect whether two instances of your custom type are considered equal.
ja: ==メソッドとhash(into:)メソッドを実装する場合、あなたのカスタム型の２つのインスタンスが等しいと考えられるどうかに影響するすべてのプロパティを使ってください。

source: When imported into Swift, the macros in the above example are equivalent to these constant declarations:
ja: Swiftへとインポートされる場合、上の例でのマクロは、これら定数宣言に相当します：

source: When importing C function parameters, however, Swift maps pointer parameters to standard library pointer types.
ja: C関数パラメータをインポートする場合、しかしながら、Swiftはポインタパラメータを標準ライブラリのポインタ型へとマップします。

source: When importing the Foundation framework, the Swift overlay provides value types for many bridged reference types.
ja: Foundationフレームワークをインポートする場合、Swiftオーバーレイは値型を多くのブリッジされる参照型に対して提供します。

source: When importing these types, Swift moves them to be nested types of their related types.
ja: それらの型をインポートするとき、スウィフトはそれらを移動して、それらの関連型の入れ子にされた型にします。

source: When iterated over, keys appear in this collection in the same order as they occur in the dictionary’s key-value pairs.
ja: すべてにわたって反復した場合、それらが辞書のキー値ペアにおいて現れるのと同じ順序で、キーはこのコレクションにおいて現れます。

source: When iterated over, values appear in this collection in the same order as they occur in the dictionary’s key-value pairs.
ja: すべてにわたって反復した場合、それらが辞書のキー値ペアにおいて現れるのと同じ順序で、値はこのコレクションにおいて現れます。

source: When negative integers are extended, the result is padded with ones.
ja: 負整数が拡張される時、結果は１で詰め物をされます。

source: When next returns nil this signifies the end of the AsyncStream.
ja: nextがnilを返す場合これはAsyncStreamの終わりを知らせます。

source: When nonnegative integers are extended, the result is padded with zeroes.
ja: 非負整数が拡張される時、結果はゼロで詰め物をされます。

source: When performing collection-based operations that return an index into a dictionary, use this subscript with the resulting value.
ja: ある辞書に対してのコレクション基盤インデックスを返す演算を実行する時、この添え字を結果の値とともに使ってください。

source: When placed next to each other in a string literal, these two scalar values are combined into a single grapheme cluster, represented by a Character instance in Swift.
ja: あるSwift文字列リテラルにおいて互いに隣り合わせに置かれる時、これら２つのスカラー値は、Swiftでは１つのCharacterインスタンスによって表される、単一の書記素クラスタへと一体化されます。

source: When that happens, the array being modified replaces its storage with a uniquely owned copy of itself, which is then modified in place.
ja: それが起こる場合、修正されている配列はそれのストレージを独自な自分だけの自身のコピーと置き換え、それはそれからそこで修正されます。

source: When the bit width of T (the type of source) is equal to or greater than this type’s bit width, the result is the truncated least-significant bits of source.
ja: T（sourceの型）のビット幅がこの型のもつビット幅と等しいかより大きいならば、結果はsourceの先端を切った最下位ビットです。

source: When the bit width of T is less than this type’s bit width, the result is sign-extended to fill the remaining bits.
ja: Tのビット幅がこの型のもつビット幅より小さいならば、結果は残りのビットを満たすように符号拡張されます。

source: When the buffer is full, discard the newly received element.
ja: バッファがいっぱいである時、新しく受け取った要素を廃棄します。

source: When the buffer is full, discard the oldest element in the buffer.
ja: バッファがいっぱいである時、バッファにおいて最古の要素を廃棄します。

source: When the collection passed to relative(to:) starts with a different index, that index is used as the lower bound instead.
ja: relative(to:)に渡されるコレクションが異なるインデックスで始まる場合、そのインデックスは代わりに下側の境界として使われます。

source: When the context provides enough type information, you can use a special form of the dictionary literal, square brackets surrounding a single colon, to initialize an empty dictionary.
ja: 文脈が十分な型情報を提供する場合、あなたは特別な形式の辞書リテラル、ただ１つのコロンを囲んでいる角括弧、を使って空の辞書を初期化することができます。

source: When the destination array’s element type is a class or an @objc protocol, bridging from NSArray to Array first calls the copy(with:) (- copyWithZone: in Objective-C) method on the array to get an immutable copy and then performs additional Swift bookkeeping work that takes O(1) time.
ja: 行き先配列の持つ要素型があるクラスまたはある@objcプロトコルである場合、NSArrayからArrayへのブリッジはまずcopy(with:)（Objective-Cでの- copyWithZone:）メソッドをその配列上で呼び出すことである不変のコピーを取得します、そしてそれから追加のSwift簿記作業を実行します、それはO(1)時間をとります。

source: When the destination array’s element type is a nonclass type that bridges to a Foundation type, bridging from NSArray to Array performs a bridging copy of the elements to contiguous storage in O(n) time.
ja: 行き先配列の持つ要素型が非クラス型でFoundation型にブリッジする場合、NSArrayからArrayへのブリッジはそれら要素のコピーを隣接ストレージにブリッジすることをO(n)時間で実行します。

source: When the dictionary’s Key and Value types are neither classes nor @objc protocols, any required bridging of elements occurs at the first access of each element.
ja: 辞書のKeyとValue型がクラスでも@objcプロトコルでもない場合、それら要素のブリッジに必要とされるあらゆることが各要素の最初のアクセスで起こります。

source: When the group returns, it implicitly waits for all child tasks to complete.
ja: グループが復帰する時、それは暗黙的に全ての子タスクが完了するのを待ちます。

source: When the original numbers array is modified, it makes a unique copy of its storage before making the modification.
ja: オリジナルのnumbers配列が修正されるとき、それはそれのストレージの特有なコピーをその修正がなされる前に行います。

source: When the return value is false, the value of i is equal to limit.
ja: 戻り値がfalseの場合、iの値はlimitに等しいです。

source: When the sequence is exhausted, the accumulating value is returned to the caller.
ja: シーケンスが使い尽くされる時、蓄積値が呼び出し側へ返されます。

source: When the sequence is exhausted, the last value returned from the closure is returned to the caller.
ja: シーケンスが使い尽くされる時、クロージャから返される最後の値が呼び出し側へ返されます。

source: When the static type of the value passed to type(of:) is constrained to a class or protocol, you can use that metatype to access initializers or other static members of the class or protocol.
ja: type(of:)に渡される値の静的型があるクラスまたはプロトコルに制約される場合、あなたはそのメタタイプを使うことでイニシャライザやそのクラスまたはプロトコルの他の静的メンバーにアクセスできます。

source: When the value is 5, the closure throws MyError, terminating the sequence.
ja: 値が5である場合、クロージャはMyErrorをスローして、シーケンスを終端しています。

source: When these invalid strings are parsed by the Double failable initializer, the example uses the nil-coalescing operator (??) to provide NaN as a fallback value.
ja: それら無効な文字列がDoubleの失敗できるイニシャライザによって解析される場合のため、この例はnil合体演算子（??）を使ってNaNをフォールバック（頼みの綱の、予備の）値として提供します。

source: When this initializer finds a key in container that doesn’t exist in scope, it casts the key to AnyObject when adding it to the dictionary.
ja: このイニシャライザが、あるキーをcontainerの中で見つけるそれがscopeの中に存在しない時、それは、そのキーをAnyObjectへとキャストします、それを辞書へと加える時に。

source: When using a CaseIterable type, you can access a collection of all of the type’s cases by using the type’s allCases property.
ja: CaseIterable型を使う場合、あなたはその型のもつケース節の全てからなるコレクションにアクセスすることが、その型のもつallCasesプロパティを使うことで可能です。

source: When using an empty array literal, specify the type of the variable or constant.
ja: 空の配列リテラルを使う時は、変数または定数の型を指定してください。

source: When using custom types to model data in your programs, you may frequently need to check whether two values are the same or different, or whether a particular value is included in a list of values.
ja: あつらえの型を使ってあなたのプログラムにおいてデータをモデル化する場合、あなたは２つの値が同じか異なるか、または特定の値が値のリストに含まれるかどうかを調べる必要がしばしばあるかもしれません。

source: When using such a declaration from another actor (or from nonisolated code), synchronization is performed through the \c shared actor instance to ensure mutually-exclusive access to the declaration.
ja: そのようなある宣言を別のアクターから（または非分離コードから）使う場合、同期は共有アクターインスタンスを通して実行されることで、その宣言への相互排他アクセスを確実にします。

source: When values are produced from a non async/await source there is a consideration that must be made on behavioral characteristics of how that production of values interacts with the iteration.
ja: 値それらが非同期／待機ではないあるソースから生み出される場合は、どのように値それらの生産が反復と相互作用するかの行動的特徴の上にそれが作られなければならないというある考慮すべき点があります。

source: When you add elements to an array and that array begins to exceed its reserved capacity, the array allocates a larger region of memory and copies its elements into the new storage.
ja: あなたがいくらかの要素を配列に加えてその配列がそれの確保した容量を越え始める時、配列はより大きなメモリ領域を割り当てて、それの要素をその新しいストレージ（貯蔵場所）にコピーします。

source: When you are operating on many values, this behavior is valuable because operations on NaN simply forward the value and don’t cause runtime errors.
ja: あなたが沢山の値に演算を行っている時、この挙動は有益です、なぜならNaNに関する演算は単にその値を次に伝えて実行時エラーを起こさないからです。

source: When you assign a value for a key and that key already exists, the dictionary overwrites the existing value.
ja: あなたがある値をあるキーに割り当てるそしてそのキーが既に存在する場合、辞書は既存の値を上書きします。

source: When you call dropFirst(_:) on an asynchronous sequence that is already an AsyncDropFirstSequence, the returned sequence simply adds the new drop count to the current drop count.
ja: あなたがdropFirst(_:)をある非同期シーケンスで既にAsyncDropFirstSequenceであるものの上で呼び出す時、返されるシーケンスは単純に新しい除外総数を現在の除外総数に加えます。

source: When you call a function that does not fully specify its parameters’ types, use the type-cast operator (as) to specify the type of an array literal.
ja: あなたが完全にそれのパラメータの型を指定しない関数を呼び出す場合は、型キャスト演算子（as）を使って配列リテラルの型を指定してください。

source: When you create a binary integer from a floating-point value using the default initializer, the value is rounded toward zero before the range is checked.
ja: あなたがバイナリ整数をある浮動小数点力省略時のイニシャライザを使って作成するとき、その値は範囲が検査される前にゼロへの丸めをされます。

source: When you create a constant or variable using one of the Boolean literals true or false, the resulting type is determined by the BooleanLiteralType alias.
ja: あなたが定数や変数をブールリテラルtrueまたはfalseを使って作成するとき、結果の型はBooleanLiteralTypeエイリアスによって決定されます。

source: When you create an observer, you start observation by calling the observe(_:options:changeHandler:) method with a key path that refers to the property you want to observe.
ja: あなたがオブザーバを作成する場合、あなたはobserve(_:options:changeHandler:)メソッドを、あなたが監視したいプロパティを参照するキーパスとともに呼び出すことによって監視を開始します。

source: When you define an enumeration without associated values, it gains Hashable conformance automatically, and you can add Hashable conformance to your other custom types by implementing the hash(into:) method.
ja: あなたが列挙を関連値なしで定義するとき、それはHashable準拠を自動的に手に入れます、そしてあなたはHashable準拠をあなたの他のあつらえの型に加えることが、hash(into:)メソッドを実装することによって行えます。

source: When you do, all known @objc class methods and properties are available as implicitly unwrapped optional methods and properties, respectively.
ja: あなたがそうする場合、全ての既知の@objcクラスのメソッドおよびプロパティは、暗黙的にアンラップされるオプショナルのメソッドおよびプロパティとしてそれぞれが利用可能です。

source: When you do, use a structure to represent errors.
ja: あなたがそうする場合は、構造体を使ってエラーを表してください。

source: When you enumerate a collection, the integer part of each pair is a counter for the enumeration, but is not necessarily the index of the paired value.
ja: あなたがあるコレクションを列挙するとき、各ペアの整数部分は列挙のためのカウンタです、しかし必ずしもペアにされた値のインデックスではありません。

source: When you import it, here's the Swift interface:
ja: あなたがそれをインポートする場合、ここにSwiftインターフェイスがあります：

source: When you import the Color structure, the Swift version is equivalent to the following:
ja: あなたがColor構造体をインポートする場合、Swift版は以下に相当します：

source: When you import the Core Foundation framework, its types are imported as Swift classes.
ja: あなたがCore Foundationフレームワークをインポートする場合、それの型は、Swiftクラスとしてインポートされます。

source: When you import these declarations into Swift, the NSCopying protocol qualification of the List type and the NSValue class qualification of the listOfValues method are preserved.
ja: あなたがそれら宣言をSwiftへとインポートする場合、NSCopyingプロトコル適格がList型に対して、そしてNSValue適格がlistOfValuesメソッドに対して、保存されます。

source: When you know how many new values you’re adding to a dictionary, use the init(minimumCapacity:) initializer to allocate the correct amount of buffer.
ja: どのくらい多くの新しい値をあなたが辞書に加えることになるかあなたが知っている場合は、init(minimumCapacity:)イニシャライザを使って正確な量のバッファを割り当ててください。

source: When you match against an Equatable value in a case statement, this operator is called behind the scenes.
ja: あなたがEquatable値に対してcase文でマッチを行うとき、この演算子が舞台裏で呼び出されます。

source: When you need a range that includes the last element of a collection, use the half-open range operator (..<) with endIndex.
ja: あなたがコレクションの最後の要素を含むある範囲を必要とする時は、半開範囲演算子（..<）をendIndexとともに使ってください。

source: When you need a range that includes the last element of an array, use the half-open range operator (..<) with endIndex.
ja: あなたが配列の最後の要素を含む範囲を必要とするならば、半開範囲演算子（..<）をendIndexとともに使ってください。

source: When you need to access APIs that require data in an NSArray instance instead of Array, use the type-cast operator (as) to bridge your instance.
ja: NSArrayインスタンスでのデータをArrayの代わりに期待するAPIにあなたがアクセスする必要がある場合、型キャスト演算子（as）を使ってあなたのインスタンスをブリッジしてください。

source: When you need to check whether your collection is empty, use the isEmpty property instead of checking that the count property is equal to zero.
ja: あなたのコレクションが空かどうか確認する必要がある場合、isEmptyプロパティを使ってください、countプロパティがゼロと等しいのを調べるのではなく。

source: When you need to perform an operation on all of an array’s elements, use a for-in loop to iterate through the array’s contents.
ja: あなたがある配列の要素のすべてである演算を実行することを必要とするならば、for-inを使って配列の内容の始めから終わりまで反復適用してください。

source: When you pass a Swift instance to an Objective-C API, it's bridged as an id parameter so that it's usable in the API as an Objective-C object.
ja: あなたがSwiftインスタンスをあるObjective-C APIに渡す場合、それはidパラメータとしてブリッジされます、それでそれはそのAPIにおいてObjective-Cオブジェクトとして利用可能です。

source: When you provide just those methods, the standard library provides default implementations for all other arithmetic methods and operators.
ja: あなたが単にそれらのメソッドだけを提供する場合、標準ライブラリが省略時の実装をすべての他の算術演算メソッドと演算子に提供します。

source: When you receive an unmanaged object from an unannotated API, immediately convert it to a memory-managed object before you work with it.
ja: あなたが注釈をつけられないAPIから管理されないオブジェクトを受け取るとき、あなたがそれを扱う前に、直ちにそれをメモリ管理されたオブジェクトに変換してください。

source: When you use AnyObject as a concrete type, you have at your disposal every @objc method and property—that is, methods and properties imported from Objective-C or marked with the @objc attribute.
ja: あなたがAnyObjectを具体的な型として使うとき、すべての@objcメソッドやプロパティ — すなわち、Objective-Cからインポートされるか、@objc属性で印されるメソッドとプロパティ — があなたの自由になります。

source: When you use Codable as a type or a generic constraint, it matches any type that conforms to both protocols.
ja: あなたがCodableをある型またはある総称体制約として使う場合、それはプロトコル両方に準拠するあらゆる型に適合します。
